In [1]:
import pandas as pd
a1 = [[1,2,3], [4,5,6,], [7,8,9]]
df1 = pd.DataFrame(a1, columns=list("ABC"), index=list("가나다"))
df2 = df1.reindex(columns=list("BCA"), index=list("나다가")).copy()
sr1 = df1.loc["가"]
df3 = df1.iloc[:2,:2]

In [2]:
df1

   A  B  C
가  1  2  3
나  4  5  6
다  7  8  9

In [3]:
df2

   B  C  A
나  5  6  4
다  8  9  7
가  2  3  1

In [4]:
sr1

A    1
B    2
C    3
Name: 가, dtype: int64

In [5]:
df3

   A  B
가  1  2
나  4  5

In [6]:
df1

   A  B  C
가  1  2  3
나  4  5  6
다  7  8  9

In [7]:
df1 * df1

    A   B   C
가   1   4   9
나  16  25  36
다  49  64  81

In [8]:
df1 * df2

    A   B   C
가   1   4   9
나  16  25  36
다  49  64  81

In [9]:
df1 * df3

      A     B   C
가   1.0   4.0 NaN
나  16.0  25.0 NaN
다   NaN   NaN NaN

In [10]:
df1.add(df3, fill_value=0)

     A     B    C
가  2.0   4.0  3.0
나  8.0  10.0  6.0
다  7.0   8.0  9.0

In [11]:
df1.mul(df3*fill_value=1)

SyntaxError: expression cannot contain assignment, perhaps you meant "=="? (2372069920.py, line 1)

In [12]:
df1.mul(df3, fill_value=1)

      A     B    C
가   1.0   4.0  3.0
나  16.0  25.0  6.0
다   7.0   8.0  9.0

In [13]:
df1+sr1

   A   B   C
가  2   4   6
나  5   7   9
다  8  10  12